# 为变量st赋值为Python
st = 'Python'
# 为变量pi赋值为3.14
pi = 3.14
# 为变量visited赋值为True
visited = True
# 将变量st的值赋值给st2
st2 = st
print(st2)
a = b = c = 20
print('a:%d b:%d c:%d' % (a, b, c))  # 使用()将多个格式转换说明符提交
d1 = 12.34
d2 = d1 + 5
print('d2:%g' % d2)
f = 0x41
print("%c" % f)
# d,i   转换为带符号的十进制形式的整数
# o     转换为带符号的八进制形式的整数
# x     转换为带符号的十六进制形式的整数（a~f）
# X     转换为带符号的十六进制形式的整数（A~F）
# e     转换为科学计数法表示的浮点数（e）
# E     转换为科学计数法表示的浮点数（E）
# f,F   转换为十进制形式的浮点数
# g     智能选择使用f或e格式
# G     智能选择使用F或E格式
# c     转换为单字符（只接受整数或单字符字符串）Unicode
# r     使用repr()将变量或表达式转换为字符串
# s     使用str()将变量或表达式转换为字符串
