print(5 & 9)  # 1  0b0101 & 0b1001 = 0b0001，Python默认4字节
print(bin(5 & 9))
print(5 | 9)  # 13 0b0101 | 0b1001 = 0b1101
print(bin(5 | 9))
a = -5
print(a & 0xff)  # 251
print(bin(a))
print(~a)  # 4 负数的补码规则：反码（原码除符号位取反）加1
print(bin(~a))  # 0b100
print(~-a)  # -6 5→0b0101 取反0b1010 -1→0b1001 原码0b1110     5→0b00000101 取反0b11111010 -1→0b11111001 原码0b10000110
print(bin(~-a))  # -0b110
print(5 ^ 9)  # 12 0b0101 ^ 0b1001 = 0b1100
print(~0xfe)  # -255  11111110 取反 00000001 -1→00000000
print("%X" % ~0xfe)  # -FF
print(~0xfe & 0xff)  # 1
print(5 << 2)  # 20 0b00000101→0b00010100,5*2^2
print(5 << 2 & 0xf)  # 4
print(-5 << 2)  # -20 0b10000101取反0b11111010 +1 补码0b11111011 左移2位0b11101100 -1→0b11101011 取反原码0b10010100
print(-5 >> 2)  # -2,-5/4
